stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_ramcfg.c
/**
  ******************************************************************************
  * @file    stm32u3xx_hal_ramcfg.c
  * @author  MCD Application Team
  * @brief   RAMCFG HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the RAMs configuration controller peripheral:
  *           + RAMCFG Initialization and De-initialization Functions.
  *           + RAMCFG Parity Error Detection Functions.
  *           + RAMCFG Write Protection Functions.
  *           + RAMCFG Erase Operation Functions.
  *           + RAMCFG Handle Interrupt and Callbacks Functions.
  *           + RAMCFG State and Error Functions.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                    ##### RAMCFG Peripheral features #####
  ==============================================================================
  [..]
    (+) Each SRAM is managed by a RAMCFG instance.
        with the following feature:

#ifdef SRAM3_BASE
        (++) Parity check on SRAM2 and SRAM3
#else
        (++) Parity check on SRAM2
#endif

        (++) Write protection (1-Kbyte granularity) on SRAM2
        (++) SRAM software erase on all SRAMs

        (++) SRAM1 placed in Core Domain.
             (+++) Size         = 192 kB

        (++) SRAM2 placed in Core Domain.
             (+++) Size         = 64 kB

#ifdef SRAM3_BASE
        (++) SRAM3 placed in Core Domain.
             (+++) Size         = 320 kB

    (+) SRAM2 and SRAM3 support Parity Error Detection (PED) correction feature.
#else
    (+) SRAM2 supports Parity Error Detection (PED) correction feature.
#endif

        When the ALE bit is set in RAMCFG SRAM control register (RAMCFG_MxCR),
        the failing parity SRAM offset word address is stored in the RAMCFG SRAM
        parity error address register RAMCFG_MxPEAR.

    (+) Each SRAMs can be erased independently through its RAMCFG instance.

    (+) SRAM2 is divided into 64 pages with
        1 kB granularity. Each page can be write protected independently through
        its RAMCFG instance.


  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
  [..]
   (#) Call HAL_RAMCFG_Init() to initialize the RAMCFG peripheral before using
       any feature. Call HAL_RAMCFG_DeInit() to de-initialize the RAMCFG when
       using this peripheral is no more needed or a hardware issue has occurred.
       HAL_RAMCFG_Init() and HAL_RAMCFG_DeInit() APIs do not change the activation
       status of Parity error feature. It is managed by HAL_RAMCFG_EnableParityErrorDetection(),
       HAL_RAMCFG_DisableParityErrorDetection() or option bytes (When available on the device).

     *** Parity Error Detection (PED) feature ***
     ============================================
    [..]
#ifdef SRAM3_BASE
          (+) Parity is supported by SRAM2 and SRAM3.
#else
          (+) Parity is supported by SRAM2.
#endif

          (+) Call HAL_RAMCFG_EnableParityErrorDetection() to set PCE bit and enable parity error detection.

          (+) Call HAL_RAMCFG_DisableParityErrorDetection() to clear PCE bit and disable parity error detection.

              The parity error detection can be also enable or disable with the SRAMx_PE user option bit
              in FLASH_OPTR register.

              When enabling SRAM parity, it is advised to initialize by software the whole
              RAM memory at the beginning of the code. This to avoid getting parity errors
              when reading non-initialized addresses.

          (+) Call HAL_RAMCFG_EnableNotification() and HAL_RAMCFG_DisableNotification()
              to enable and disable PED interrupts. Interrupts could be:
                    (++) Parity error detection interrupt.
                    (++) Parity error detection interrupt redirected to Non Maskable
                          interrupt (NMI).

              When a parity error is detected the PED and CPED bits are set in RAMCFG SRAM
              interrupt status register (RAMCFG_MxISR) and RAMCFG SRAM interrupt clear register
              (RAMCFG_MxICR). An interrupt or NMI can be generated if enabled by the PEIE or PENMI
              bits in the RAMCFG SRAM control register (RAMCFG_MxCR).

          (+) Call HAL_RAMCFG_LatchParityErrorAddress() to set ALE bit and track parity error location address

          (+) Call HAL_RAMCFG_GetParityErrorAddress() to get the failing parity SRAM offset word
              address stored in the RAMCFG parity error address register (RAMCFG_MxPEAR) together
              with the failing byte(s) parity error flag and the AHB bus master ID.

              When the PED and CPED bits are already set any subsequent parity failing access SRAM
              offset word address is no longer updated. A new parity error SRAM offset word address will
              only be latched when PED and CPED are cleared.

          (+) Call HAL_RAMCFG_IsParityErrorDetected() to check if an Parity error was detected.
              This API is used in silent mode (No PED interrupt is enabled).

     *** Write protection feature ***
     ================================
    [..]
          (+) Call HAL_RAMCFG_EnableWriteProtection() to enable the write
              protection for the given SRAM2 page(s).

          (+) There is no API to disable write protection as this feature can
              be disabled only by a global peripheral reset or system reset.

          (+) Any write access to a write protected area of SRAM2 causes a
              HardFault interrupt.

